#+TITLE: 管道
#+AUTHOR: Jinghui Hu
#+EMAIL: hujinghui@buaa.edu.cn
#+DATE: <2023-11-24 Fri>
#+STARTUP: overview num indent
#+OPTIONS: ^:nil
#+PROPERTY: header-args:sh :results output :dir ../../study/os/xv6-public


* pipe 概念介绍
#+BEGIN_SRC sh
  ls | wc
#+END_SRC

#+RESULTS:
:     185     185    1497

ls(9)
  - stdin
  - stdout xxx
wc(10)
  - stdin  yyy
  - stdout


* struct pipe
[[file:../../study/os/xv6-public/pipe.c::struct spinlock lock;]]

管道结构体数据结构定义
1. p->lock 锁
2. 读写的文件描述符: readopen, writeopen
3. 读写字节数: nread, nwrite
4. data 数据缓冲器, 循环缓冲
   - 空 nwrite == nread
   - 满 nwrite == nread+PIPESIZE

* 管道读写
1. pipewrite
   - 获取 p->lock
   - 尝试将 addr 的数据写入 p->data
   - 唤醒读进程
2. piperead
   - 获取 p->lock
   - 尝试读取数据 p->data, 写入 addr 处
   - 唤醒写进程
3. pipe 实现中使用不同的读写 chan ,
   - 读 chan 是 p->nread
   - 写 chan 是 p->nwrite
   - 目的是提高效率
   - 防止 for 循环中造成读写进程等待同一个 chan 的争抢


pipe 读写调试过程:
#+BEGIN_EXAMPLE
  E1: w nr=0 nw=1
  E2: w nr=0 nw=1
  ...
  E6: w nr=0 nw=6
  E7: r nr=0 nw=6
  E8: w nr=6 nw=7
  E9: r nr=6 nw=8
  ...
#+END_EXAMPLE
